sysbench/results/aws/mysql/alta/parallel/re-test/read_3.txt
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            185677
        write:                           0
        other:                           0
        total:                           185677
    transactions:                        185677 (3086.74 per sec.)
    queries:                             185677 (3086.74 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3086.7445
    time elapsed:                        60.1530s
    total number of events:              185677

Latency (ms):
         min:                                    0.18
         avg:                                   16.16
         max:                                  979.91
         95th percentile:                       48.34
         sum:                              2999725.02

Threads fairness:
    events (avg/stddev):           3713.5400/111.58
    execution time (avg/stddev):   59.9945/0.01